Revit 2024 API
TransactionGroup Constructor (Document, String)
 It constructs a transaction group object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public TransactionGroup(
	Document document,
	string transGroupName
)
Visual Basic
Public Sub New ( _
	document As Document, _
	transGroupName As String _
)
Visual C++
public:
TransactionGroup(
	Document^ document,
	String^ transGroupName
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for which this transaction group is being used.
transGroupName
Type: System.String
 Name of the group. The name will be used only for a group that is assimilated at the end.
Remarks
 The group does not start until its Start method is called.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransactionGroup Class
TransactionGroup Overload
Autodesk.Revit.DB Namespace